session3/cours/java-sql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-04 Wed 01:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Exécuter des requêtes SQL en Java</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="bernard" />
</head>
<body>
<div id="content">
<h1 class="title">Exécuter des requêtes SQL en Java</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org99f2af5">1. Types d'utilisations de bases de données</a></li>
<li><a href="#org4b9c811">2. Utilisation de SGBDR en Java : préliminaires</a>
<ul>
<li><a href="#orga59d3f6">2.1. Chargement de drivers</a></li>
<li><a href="#org6150988">2.2. Établissement de la connection au SGBDR</a></li>
</ul>
</li>
<li><a href="#org078b928">3. Utilisation de SGBDR en Java : requêtes SQL</a>
<ul>
<li><a href="#org734e85d">3.1. java.sql.Statement</a></li>
<li><a href="#orgceb75e3">3.2. java.sql.PreparedStatement</a></li>
<li><a href="#org5f6d65e">3.3. Lecture des résultats d'une requête SELECT</a></li>
<li><a href="#org6081f53">3.4. Exemple de relation Many to Many, table d'associations</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org99f2af5" class="outline-2">
<h2 id="org99f2af5"><span class="section-number-2">1</span> Types d'utilisations de bases de données</h2>
<div class="outline-text-2" id="text-1">
<p>
Il y a plusieurs façons d'utiliser des bases de données avec un
logiciel écrit en Java :
</p>

<dl class="org-dl">
<dt>Embarquée</dt><dd>Lorsque le programme de gestion de bases de données est
écrit en Java, il peut être directement intégré en tant
que bibliothèque Java. Dans ce cas, on peut même
utiliser une "base de données" virtuelle en mémoire. Si
l'accès aux données est alors très rapide, il n'y a
évidemment pas de durabilité, donc ceci est plutôt
réservé aux situations de tests.</dd>
<dt>Serveur (local) et tables dédiés</dt><dd>Le serveur est utilisé pour
permettre la durabilité des entités manipulées par le logiciel.</dd>
<dt>Serveurs (distant) et tables partagés</dt><dd>Le logiciel est utilisé
pour manipuler des entités déjà existantes.</dd>
</dl>
</div>
</div>


<div id="outline-container-org4b9c811" class="outline-2">
<h2 id="org4b9c811"><span class="section-number-2">2</span> Utilisation de SGBDR en Java : préliminaires</h2>
<div class="outline-text-2" id="text-2">
<p>
Les SGDBR et leurs drivers Java permettent différents niveaux de
fonctionnalités. Dans un soucis de simplicité et de compatibilité maximale, on
ne s'intéresse ici qu'aux fonctionnalités les plus basiques dont la
disponibilité est garantie. En cas de besoin, et si le SGDBR est connu et fixé,
on pourra utiliser <a href="https://docs.oracle.com/javase/tutorial/jdbc/basics/retrieving.html">des fonctionnalités plus avancées</a>.
</p>
</div>

<div id="outline-container-orga59d3f6" class="outline-3">
<h3 id="orga59d3f6"><span class="section-number-3">2.1</span> Chargement de drivers</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Tout d'abord, il faut utiliser le(s) driver(s) JDBC (Java DataBase Connectivity)
adapté(s) au(x) SGBDR utilisé(s).
</p>

<p>
Ensuite, il faut rendre les drivers accessibles au programme Java.
Habituellement, il suffit d'utiliser <code>import</code> pour utiliser n'importe quelle
classe (sous réserve qu'elle soit disponible dans le <code>CLASSPATH</code> lors de la
compilation et de l'exécution du programme.
</p>

<p>
Dans le cas des classes de drivers JDBC, on veut pouvoir choisir le SGDBR, et
donc le driver, à l'exécution et non à la compilation. En effet, on peut vouloir
utiliser différents SGDBR en environnement de test et en production. Évidemment,
il faut que ce soit le même programme compilé qui soit exécuté en test et en
production. Pour la même raison, parce que les URL d'accès au SGBDR et les
comptes (login et mot de passe associé) ne sont pas forcément les mêmes en test
et en production, on fera aussi en sorte que ces informations soient aussi
paramétrables sans recompilation, donc hors du code source.
</p>

<p>
En fait, pour les mots de passe, il est aussi essentiel de ne jamais les écrire
dans un code source. En effet, les codes sources sont souvent diffusés
largement, notamment par des systèmes de gestion de version et doivent donc
contenir aucune information confidentielle. Par exemple, lorsqu'on stocke des
informations confidentielles dans un fichier .properties dans un projet géré par
git, il est essentiel d'exclure ce fichier de la gestion de version à l'aide de
<a href="https://git-scm.com/docs/gitignore">gitignore</a>.
</p>


<p>
Pour que les classes des drivers JDBC soient chargées dynamiquement (à
l'exécution), il faut exécuter la méthode statique <code>forName</code> de la classe <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/Class.html">Class</a>  :
</p>

<ul class="org-ul">
<li>pour Postgresql :</li>
</ul>
<div class="org-src-container">
<pre class="src src-java">Class.forName(<span style="color: #008000;">"org.postgresql.Driver"</span>);
</pre>
</div>
<ul class="org-ul">
<li>pour H2 :</li>
</ul>
<div class="org-src-container">
<pre class="src src-java">Class.forName(<span style="color: #008000;">"org.h2.Driver"</span>);
</pre>
</div>
<ul class="org-ul">
<li>pour MySQL :</li>
</ul>
<div class="org-src-container">
<pre class="src src-java">Class.forName(<span style="color: #008000;">"com.mysql.jdbc.Driver"</span>);
</pre>
</div>

<p>
Cet appel de méthode peut lancer une exception de type <code>ClassNotFoundException</code>
qu'il faut donc gérer.
</p>

<p>
Ensuite, le driver correspondant au SGBDR sera choisi en fonction de l'URL de
connection à la base. Cette URL étant dans une chaîne de caractères, elle est
donc aussi configurable à l'exécution.
</p>


<dl class="org-dl">
<dt>Exercice</dt><dd>Créer un projet Maven avec une dépendance sur la
bibliothèque de driver Postgresql et une autre sur la
bibliothèque de driver H2. Écrire un programme qui
charge ainsi le driver à l'exécution, suivant ce qui est passé en argument :</dd>
</dl>
</div>
</div>
