session3/cours/java-sql.md
- [Types d'utilisations de bases de données](#org8003c57)
- [Utilisation de SGBDR en Java : préliminaires](#orga0c1627)
  - [Chargement de drivers](#orgb9dc8d8)
  - [Établissement de la connection au SGBDR](#org2a61ce3)
- [Utilisation de SGBDR en Java : requêtes SQL](#org4cb2e4f)
  - [java.sql.Statement](#org322675b)
  - [java.sql.PreparedStatement](#org408eedd)
  - [Lecture des résultats d'une requête SELECT](#orgfb99be4)
  - [Exemple de relation Many to Many, table d'associations](#org1572399)



<a id="org8003c57"></a>

# Types d'utilisations de bases de données

Il y a plusieurs façons d'utiliser des bases de données avec un logiciel écrit en Java :

-   **Embarquée:** Lorsque le programme de gestion de bases de données est écrit en Java, il peut être directement intégré en tant que bibliothèque Java. Dans ce cas, on peut même utiliser une "base de données" virtuelle en mémoire. Si l'accès aux données est alors très rapide, il n'y a évidemment pas de durabilité, donc ceci est plutôt réservé aux situations de tests.
-   **Serveur (local) et tables dédiés:** Le serveur est utilisé pour permettre la durabilité des entités manipulées par le logiciel.
-   **Serveurs (distant) et tables partagés:** Le logiciel est utilisé pour manipuler des entités déjà existantes.


<a id="orga0c1627"></a>

# Utilisation de SGBDR en Java : préliminaires

Les SGDBR et leurs drivers Java permettent différents niveaux de fonctionnalités. Dans un soucis de simplicité et de compatibilité maximale, on ne s'intéresse ici qu'aux fonctionnalités les plus basiques dont la disponibilité est garantie. En cas de besoin, et si le SGDBR est connu et fixé, on pourra utiliser [des fonctionnalités plus avancées](https://docs.oracle.com/javase/tutorial/jdbc/basics/retrieving.html).


<a id="orgb9dc8d8"></a>

## Chargement de drivers

Tout d'abord, il faut utiliser le(s) driver(s) JDBC (Java DataBase Connectivity) adapté(s) au(x) SGBDR utilisé(s).

Ensuite, il faut rendre les drivers accessibles au programme Java. Habituellement, il suffit d'utiliser `import` pour utiliser n'importe quelle classe (sous réserve qu'elle soit disponible dans le `CLASSPATH` lors de la compilation et de l'exécution du programme.

Dans le cas des classes de drivers JDBC, on veut pouvoir choisir le SGDBR, et donc le driver, à l'exécution et non à la compilation. En effet, on peut vouloir utiliser différents SGDBR en environnement de test et en production. Évidemment, il faut que ce soit le même programme compilé qui soit exécuté en test et en production. Pour la même raison, parce que les URL d'accès au SGBDR et les comptes (login et mot de passe associé) ne sont pas forcément les mêmes en test et en production, on fera aussi en sorte que ces informations soient aussi paramétrables sans recompilation, donc hors du code source.

En fait, pour les mots de passe, il est aussi essentiel de ne jamais les écrire dans un code source. En effet, les codes sources sont souvent diffusés largement, notamment par des systèmes de gestion de version et doivent donc contenir aucune information confidentielle. Par exemple, lorsqu'on stocke des informations confidentielles dans un fichier .properties dans un projet géré par git, il est essentiel d'exclure ce fichier de la gestion de version à l'aide de [gitignore](https://git-scm.com/docs/gitignore).

Pour que les classes des drivers JDBC soient chargées dynamiquement (à l'exécution), il faut exécuter la méthode statique `forName` de la classe [Class](https://docs.oracle.com/javase/8/docs/api/java/lang/Class.html) :

-   pour Postgresql :

```java
Class.forName("org.postgresql.Driver");
```

-   pour H2 :

```java
Class.forName("org.h2.Driver");
```

-   pour MySQL :

```java
Class.forName("com.mysql.jdbc.Driver");
```

Cet appel de méthode peut lancer une exception de type `ClassNotFoundException` qu'il faut donc gérer.

Ensuite, le driver correspondant au SGBDR sera choisi en fonction de l'URL de connection à la base. Cette URL étant dans une chaîne de caractères, elle est donc aussi configurable à l'exécution.

-   **Exercice:** Créer un projet Maven avec une dépendance sur la bibliothèque de driver Postgresql et une autre sur la bibliothèque de driver H2. Écrire un programme qui charge ainsi le driver à l'exécution, suivant ce qui est passé en argument :
