session3/cours/java-sql.org
** Établissement de la connection au SGBDR

La connection au SGDBR est matérialisée par un objet instance d'une classe
implémentant l'interface [[https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html][java.sql.Connection]] . Cette connection peut être en
[[https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#getAutoCommit()][mode autocommit ou non]]. On récupère cet objet par un appel à la méthode
[[https://docs.oracle.com/javase/7/docs/api/java/sql/DriverManager.html#getConnection(java.lang.String,%2520java.lang.String,%2520java.lang.String)][java.sql.DriverManager.getConnection()]]. Par exemple, si les URL, login et mot de
passe sont stockés dans une =Map<String,String> env= et assocés aux clés ="URL"=, ="USER"= et ="PASS"= :

#+BEGIN_SRC java
Connection conn= DriverManager.getConnection(env.get("URL"), env.get("USER"), env.get("PASS"));
#+END_SRC

L'url étant de la forme "jdbc:SGBD_NAME://DBSERVER_NAME:DBSERVER_PORT/DATABASE_NAME".

Il faudra s'assurer que la connection sera fermée à un appel à la méthode
[[https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#close()][close()]]. On remarque que l'interface =java.sql.Connection= hérite de l'interface
=java.lang.AutoClosable=, ce qui implique donc qu'on peut faire l'initialisation
dans un bloc =try(){}= (dit «try with resources»). Attention : cette méthode
=.close()= peut elle-même lancer une [[https://docs.oracle.com/javase/7/docs/api/java/sql/SQLException.html][SQLException]] qu'il faut donc aussi gérer.

On passera l'objet connection aux différentes méthodes qui s'en serviront pour
interagir avec le SGBDR.

* Utilisation de SGBDR en Java : requêtes SQL

Il y a deux façons de faire exécuter des requêtes SQL en Java, suivant qu'on
utilise des [[https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html][java.sql.Statement]] ou des [[https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html][java.sql.PreparedStatement]].


