session3/cours/java-sql.html

<div id="outline-container-org6150988" class="outline-3">
<h3 id="org6150988"><span class="section-number-3">2.2</span> Établissement de la connection au SGBDR</h3>
<div class="outline-text-3" id="text-2-2">
<p>
La connection au SGDBR est matérialisée par un objet instance d'une classe
implémentant l'interface <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html">java.sql.Connection</a> . Cette connection peut être en
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#getAutoCommit()">mode autocommit ou non</a>. On récupère cet objet par un appel à la méthode
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/DriverManager.html#getConnection(java.lang.String,%20java.lang.String,%20java.lang.String)">java.sql.DriverManager.getConnection()</a>. Par exemple, si les URL, login et mot de
passe sont stockés dans une <code>Map&lt;String,String&gt; env</code> et assocés aux clés <code>"URL"</code>, <code>"USER"</code> et <code>"PASS"</code> :
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span>= DriverManager.getConnection(env.get(<span style="color: #008000;">"URL"</span>), env.get(<span style="color: #008000;">"USER"</span>), env.get(<span style="color: #008000;">"PASS"</span>));
</pre>
</div>

<p>
L'url étant de la forme "jdbc:SGBD_NAME://DBSERVER_NAME:DBSERVER_PORT/DATABASE_NAME".
</p>

<p>
Il faudra s'assurer que la connection sera fermée à un appel à la méthode
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#close()">close()</a>. On remarque que l'interface <code>java.sql.Connection</code> hérite de l'interface
<code>java.lang.AutoClosable</code>, ce qui implique donc qu'on peut faire l'initialisation
dans un bloc <code>try(){}</code> (dit «try with resources»). Attention : cette méthode
<code>.close()</code> peut elle-même lancer une <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/SQLException.html">SQLException</a> qu'il faut donc aussi gérer.
</p>

<p>
On passera l'objet connection aux différentes méthodes qui s'en serviront pour
interagir avec le SGBDR.
</p>
</div>
</div>
</div>

<div id="outline-container-org078b928" class="outline-2">
<h2 id="org078b928"><span class="section-number-2">3</span> Utilisation de SGBDR en Java : requêtes SQL</h2>
<div class="outline-text-2" id="text-3">
<p>
Il y a deux façons de faire exécuter des requêtes SQL en Java, suivant qu'on
utilise des <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html">java.sql.Statement</a> ou des <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html">java.sql.PreparedStatement</a>.
</p>
</div>
