session3/cours/java-sql.md


<a id="org2a61ce3"></a>

## Établissement de la connection au SGBDR

La connection au SGDBR est matérialisée par un objet instance d'une classe implémentant l'interface [java.sql.Connection](https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html) . Cette connection peut être en [mode autocommit ou non](https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#getAutoCommit()). On récupère cet objet par un appel à la méthode [java.sql.DriverManager.getConnection()](https://docs.oracle.com/javase/7/docs/api/java/sql/DriverManager.html#getConnection(java.lang.String,%20java.lang.String,%20java.lang.String)). Par exemple, si les URL, login et mot de passe sont stockés dans une `Map<String,String> env` et assocés aux clés `"URL"`, `"USER"` et `"PASS"` :

```java
Connection conn= DriverManager.getConnection(env.get("URL"), env.get("USER"), env.get("PASS"));
```

L'url étant de la forme "jdbc:SGBD\_NAME://DBSERVER\_NAME:DBSERVER\_PORT/DATABASE\_NAME".

Il faudra s'assurer que la connection sera fermée à un appel à la méthode [close()](https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#close()). On remarque que l'interface `java.sql.Connection` hérite de l'interface `java.lang.AutoClosable`, ce qui implique donc qu'on peut faire l'initialisation dans un bloc `try(){}` (dit «try with resources»). Attention : cette méthode `.close()` peut elle-même lancer une [SQLException](https://docs.oracle.com/javase/7/docs/api/java/sql/SQLException.html) qu'il faut donc aussi gérer.

On passera l'objet connection aux différentes méthodes qui s'en serviront pour interagir avec le SGBDR.


<a id="org4cb2e4f"></a>

# Utilisation de SGBDR en Java : requêtes SQL

Il y a deux façons de faire exécuter des requêtes SQL en Java, suivant qu'on utilise des [java.sql.Statement](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html) ou des [java.sql.PreparedStatement](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html).
