session3/cours/java-sql.html


<div id="outline-container-org734e85d" class="outline-3">
<h3 id="org734e85d"><span class="section-number-3">3.1</span> java.sql.Statement</h3>
<div class="outline-text-3" id="text-3-1">
<p>
On commence par créer l'objet par un appel à <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#createStatement()">createStatement()</a> sur l'objet qui
implémente l'interface <code>Connection</code>. Cet objet nouvellement créé devra lui aussi
être fermé par un appel à sa méthode <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#close()">close()</a>. Comme il implémente l'interface
<code>AutoCloseable</code>, on peut créer l'objet dans un <code>try(){}</code> («try with resources»).
</p>

<p>
Ensuite, on peut appeler sur cet objet l'une des méthodes suivante :
</p>

<ul class="org-ul">
<li><a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#execute(java.lang.String)">execute(String sql)</a> pour exécuter la commande SQL passée en paramètre, en
ayant en valeur de retour un booléen indiquant si l'exécution s'est déroulée
sans erreur ou non.</li>
<li><a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#executeUpdate(java.lang.String)">executeUpdate(String sql)</a> pour exécuter la commande SQL passée en paramètre,
en ayant en valeur de retour le nombre de lignes modifiées (comme son nom
l'indique, on utilise cette méthode pour des commandes SQL <code>UPDATE</code>).</li>
<li><a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#executeQuery(java.lang.String)">executeQuery(String sql)</a> pour exécuter la commande SQL passée en paramètre, en
ayant en valeur de retour un objet implémentant l'interface <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html">java.sql.ResultSet</a>
qui permettra de récupérer les résultat d'une commande SQL <code>SELECT</code>.</li>
</ul>


<p>
De plus, si l'on veut exécuter plusieurs commandes SQL en une seule fois, pour
des raisons de performance, on peut à la place utiliser la méthode
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#addBatch(java.lang.String)">addBatch(String sql)</a> pour chacune des commandes, puis déclencher l'exécution de
toutes celles-ci par un appel à <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#executeBatch()">executeBatch()</a>.
</p>


<p>
Souvent, la commande SQL à exécuter dépend de valeurs qui ne sont connues qu'à
 l'exécution, par exemple les données à ajouter dans un <code>INSERT</code> ou des critères
 d'une clause <code>WHERE</code>. Il est possible de construire dynamiquement la commande
 SQL en concaténant des chaînes de caractères mais il faut alors faire très
 attention au risque d'<a href="https://fr.wikipedia.org/wiki/Injection_SQL">injection SQL</a>. Même sans utilisateurs hostiles, il faut
 de toutes façons prendre en compte l'échappement des caractères spéciaux dans
 une chaîne de caractères. Par exemple, le guillemet simple, utilisé souvernt
 pour l'apostrophe, doit être remplacé par deux guillemets simples pour éviter
 qu'il soit interprété comme la fin de chaîne. On peut faire pour cela un appel comme ceci :
 <code>.replaceAll("'","''")</code>.
</p>


<p>
Il est cependant préférable d'utiliser des <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html">java.sql.PreparedStatement</a> pour ne
pas avoir à gérer soi-même les arguments.
</p>
</div>
</div>
