session3/cours/java-sql.md


<a id="org322675b"></a>

## java.sql.Statement

On commence par créer l'objet par un appel à [createStatement()](https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#createStatement()) sur l'objet qui implémente l'interface `Connection`. Cet objet nouvellement créé devra lui aussi être fermé par un appel à sa méthode [close()](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#close()). Comme il implémente l'interface `AutoCloseable`, on peut créer l'objet dans un `try(){}` («try with resources»).

Ensuite, on peut appeler sur cet objet l'une des méthodes suivante :

-   [execute(String sql)](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#execute(java.lang.String)) pour exécuter la commande SQL passée en paramètre, en ayant en valeur de retour un booléen indiquant si l'exécution s'est déroulée sans erreur ou non.
-   [executeUpdate(String sql)](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#executeUpdate(java.lang.String)) pour exécuter la commande SQL passée en paramètre, en ayant en valeur de retour le nombre de lignes modifiées (comme son nom l'indique, on utilise cette méthode pour des commandes SQL `UPDATE`).
-   [executeQuery(String sql)](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#executeQuery(java.lang.String)) pour exécuter la commande SQL passée en paramètre, en ayant en valeur de retour un objet implémentant l'interface [java.sql.ResultSet](https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html) qui permettra de récupérer les résultat d'une commande SQL `SELECT`.

De plus, si l'on veut exécuter plusieurs commandes SQL en une seule fois, pour des raisons de performance, on peut à la place utiliser la méthode [addBatch(String sql)](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#addBatch(java.lang.String)) pour chacune des commandes, puis déclencher l'exécution de toutes celles-ci par un appel à [executeBatch()](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#executeBatch()).

Souvent, la commande SQL à exécuter dépend de valeurs qui ne sont connues qu'à l'exécution, par exemple les données à ajouter dans un `INSERT` ou des critères d'une clause `WHERE`. Il est possible de construire dynamiquement la commande SQL en concaténant des chaînes de caractères mais il faut alors faire très attention au risque d'[injection SQL](https://fr.wikipedia.org/wiki/Injection_SQL). Même sans utilisateurs hostiles, il faut de toutes façons prendre en compte l'échappement des caractères spéciaux dans une chaîne de caractères. Par exemple, le guillemet simple, utilisé souvernt pour l'apostrophe, doit être remplacé par deux guillemets simples pour éviter qu'il soit interprété comme la fin de chaîne. On peut faire pour cela un appel comme ceci : `.replaceAll("'","''")`.

Il est cependant préférable d'utiliser des [java.sql.PreparedStatement](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html) pour ne pas avoir à gérer soi-même les arguments.
