session3/cours/java-sql.org
** java.sql.PreparedStatement

Toujours à partir de l'objet implémentant l'interface [[https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html][java.sql.Connection]], on
peut utiliser la méthode [[https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#prepareStatement(java.lang.String)][prepareStatement(String sql)]] pour créer un objet
implémentant l'interface [[https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html][java.sql.PreparedStatement]]. La chaîne de caractère
passée en argument contient le code de la commande SQL avec des '?' à la place
des arguments de la commande. Par exemple, pour insérer une nouvelle ligne dans
notre table =city=, on pourra utiliser :

#+BEGIN_SRC java
String insertCmd= "INSERT INTO cities VALUES(DEFAULT, ?, ?, ?);";
try(PreparedStatement stmt= conn.prepareStatement(insertCmd)){
}
#+END_SRC

Le =DEFAULT= permet de laisser la base de données attribuer la valeur
de la clé primaire.

Comme pour la création d'un [[https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html][java.sql.Statement]], on peut (devrait ?) utiliser un
/try with resources/ parce que l'objet créé implémente l'interface
=java.lang.AutoCloseable=.

Ensuite, on peut utiliser sur cet objet les méthodes =setXXX()= comme
[[https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#setDouble(int,%2520double)][setDouble(int parameterIndex, double parameterValue)]] ou [[https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#setString(int,%2520java.lang.String)][setString(int
parameterIndex, String parameterValue)]] pour donner des valeurs à chacun des
paramètres représentés par un '?' dans la chaîne passée en argument de
[[https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#prepareStatement(java.lang.String)][prepareStatement(String sql)]]. Attention ! Les =parameterIndex= commencent à 1 et
non à 0. Si l'on veut insérer une valeur manquante =NULL=, il faut utiliser la
méthode [[https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#setNull(int,%2520int)][setNull(int parameterIndex, int sqlType)]]. L'argument =sqlType= étant
l'une des constantes nommées définies dans la classe [[https://docs.oracle.com/javase/7/docs/api/java/sql/Types.html][java.sql.Types]].

Ensuite, une fois que tous les arguments on reçu une valeur, on peut appeler
l'une des méthodes [[https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#execute()][execute()]], [[https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#executeQuery()][executeQuery()]] ou [[https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#executeUpdate()][executeUpdate()]]. On peut aussi
créer un batch de plusieurs commandes à executer à l'aide des méthodes
[[https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#addBatch()][addBatch()]] et [[https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#executeBatch()][executeBatch()]].


