session3/cours/java-sql.html



<div id="outline-container-orgceb75e3" class="outline-3">
<h3 id="orgceb75e3"><span class="section-number-3">3.2</span> java.sql.PreparedStatement</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Toujours à partir de l'objet implémentant l'interface <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html">java.sql.Connection</a>, on
peut utiliser la méthode <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#prepareStatement(java.lang.String)">prepareStatement(String sql)</a> pour créer un objet
implémentant l'interface <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html">java.sql.PreparedStatement</a>. La chaîne de caractère
passée en argument contient le code de la commande SQL avec des '?' à la place
des arguments de la commande. Par exemple, pour insérer une nouvelle ligne dans
notre table <code>city</code>, on pourra utiliser :
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">insertCmd</span>= <span style="color: #008000;">"INSERT INTO cities VALUES(DEFAULT, ?, ?, ?);"</span>;
<span style="color: #0000FF;">try</span>(<span style="color: #6434A3;">PreparedStatement</span> <span style="color: #BA36A5;">stmt</span>= conn.prepareStatement(insertCmd)){
}
</pre>
</div>

<p>
Le <code>DEFAULT</code> permet de laisser la base de données attribuer la valeur
de la clé primaire.
</p>

<p>
Comme pour la création d'un <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html">java.sql.Statement</a>, on peut (devrait ?) utiliser un
<i>try with resources</i> parce que l'objet créé implémente l'interface
<code>java.lang.AutoCloseable</code>.
</p>

<p>
Ensuite, on peut utiliser sur cet objet les méthodes <code>setXXX()</code> comme
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#setDouble(int,%20double)">setDouble(int parameterIndex, double parameterValue)</a> ou <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#setString(int,%20java.lang.String)">setString(int
parameterIndex, String parameterValue)</a> pour donner des valeurs à chacun des
paramètres représentés par un '?' dans la chaîne passée en argument de
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#prepareStatement(java.lang.String)">prepareStatement(String sql)</a>. Attention ! Les <code>parameterIndex</code> commencent à 1 et
non à 0. Si l'on veut insérer une valeur manquante <code>NULL</code>, il faut utiliser la
méthode <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#setNull(int,%20int)">setNull(int parameterIndex, int sqlType)</a>. L'argument <code>sqlType</code> étant
l'une des constantes nommées définies dans la classe <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Types.html">java.sql.Types</a>.
</p>

<p>
Ensuite, une fois que tous les arguments on reçu une valeur, on peut appeler
l'une des méthodes <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#execute()">execute()</a>, <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#executeQuery()">executeQuery()</a> ou <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#executeUpdate()">executeUpdate()</a>. On peut aussi
créer un batch de plusieurs commandes à executer à l'aide des méthodes
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#addBatch()">addBatch()</a> et <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#executeBatch()">executeBatch()</a>.
</p>
</div>
</div>
