session3/cours/java-sql.org
** Lecture des résultats d'une requête SELECT

Lorsque l'on exécute une requête =SELECT=, on utilise la méthode [[https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#executeQuery()][executeQuery()]]
qui retourne un objet implémentant l'interface [[https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html][java.sql.ResultSet]]. Cet objet
permet de récupérer chacunes des données de chacune des lignes correspondant à
la requête. Pour passer à la ligne suivante en testant s'il y en a une, on
utilise la méthode [[https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#next()][next()]] (le plus souvent comme condition de continuation dans
une boucle =while()= pour traiter toutes les lignes de la première à la
dernière). Ensuite, pour chacune des lignes (à l'intérieur de la boucle, donc),
on peut récupérer la valeur de chacune des colonnes avec des appels aux méthodes
[[https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getDouble(java.lang.String)][getDouble(String colName)]], [[https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getInt(java.lang.String)][getInt(String colName)]], [[https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getLong(java.lang.String)][getLong(String colName)]],
[[https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getString(java.lang.String)][getString(String colName)]] et autres. Il est aussi possible de passer des numéros
de colonne en argument plutôt que d'utiliser les noms, mais il faut alors se
souvenir non seulement de l'ordre des colonnes dans le resultat, mais aussi que
leur numérotation commence à 1 et non à 0. Toujours dans un soucis de plus
grande compatibilité avec tous les drivers JDBC disponibles, mais aussi dans un
soucis de performance, il est préférable de se contenter de lire les lignes les
unes après les autres et pour chaque ligne et de ne lire les données qu'une
seule fois pour une instance de =ResultSet= donnée.

Par exemple, pour afficher le contenue d'une table =city= contenant des communes avec leur latitude et longitude, on pourrait écrire le code suivant :
#+BEGIN_SRC java
try (Statement stmt = conn.createStatement()) {
    ResultSet rs = stmt.executeQuery("SELECT id, name, latitude, longitude from city");
    while (rs.next()) {
	try {
	    System.out.println(String.format("id: %d, name: %s, latitude: %f, longitude: %f",
					     rs.getLong("id"),
					     rs.getString("name"),
					     rs.getDouble("latitude"),
					     rs.getDouble("longitude")));
	} catch (Exception e) {
	    System.err.println(e);
	}
    }

} catch (SQLException e) {
    e.printStackTrace();
}

#+END_SRC

On lit des (références vers des) objets plutôt que des valeurs de types
primitifs lorsque les colonnes peuvent contenir des =NULL=, auquel cas la
référence retournées est nulle.


- Exercice :: Écrire un programme qui afficher le contenu d'une table
              =city= contenant des communes avec leur latitude et
              longitude. Vous pouvez créer une telle table en local,
              mais aussi utiliser une table =city= disponible sur le
              serveur ~horton.elephantsql.com~ au port ~5432~ avec
              comme login ~vnzaekhx~ et comme mot de passe
              ~oWN4ryvxxdjYWsko1u3WTW23k6yB7bM9~.
- Exercice :: Écrire un programme qui remplisse une table d'une base
              de données locale à partir du fichier ~Communes.csv~ qui
              avait été donné lors de la session précédente.
- Exercice :: Écrire un programme qui remplisse une table d'une base
              de données locales à partir des donnés mises à
              disposition par [[http://sql.sh/736-base-donnees-villes-francaises][données mises à disposition par Tony
              Archambeau]].

** Exemple de relation Many to Many, table d'associations
Pour le stockage de l'information concernant les codes postaux de chacune des
villes, le format proposé (une colonne de type chaîne de caractères pouvant
contenir une liste de codes postaux séparés par des '-', n'est ni pratique ni
performant. On va écrire un programme implémentant la relation «Many to Many»
par une table d'associations. Il s'agit d'une relation «Many to Many» car une
ville peut avoir plusieurs codes postaux, mais un code postal peut être associé
à plusieurs villes. Pour représenter cette association, on va créer deux tables :
- une table =postalcodes= qui va contenir la chaîne de caractère du code
  postal et un identifiant.
- une table =city_postalcode= qui va contenir les associations entre la table
  =cities= et la table =postalcodes=, avec seulement les deux colonnes
  =cities_pk= et =postalcodes_pk= ("pk" pour Primary Key). La clé primaire de
  cette table est constituée par ces deux colonnes.






