session3/cours/java-sql.html


<div id="outline-container-org5f6d65e" class="outline-3">
<h3 id="org5f6d65e"><span class="section-number-3">3.3</span> Lecture des résultats d'une requête SELECT</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Lorsque l'on exécute une requête <code>SELECT</code>, on utilise la méthode <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#executeQuery()">executeQuery()</a>
qui retourne un objet implémentant l'interface <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html">java.sql.ResultSet</a>. Cet objet
permet de récupérer chacunes des données de chacune des lignes correspondant à
la requête. Pour passer à la ligne suivante en testant s'il y en a une, on
utilise la méthode <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#next()">next()</a> (le plus souvent comme condition de continuation dans
une boucle <code>while()</code> pour traiter toutes les lignes de la première à la
dernière). Ensuite, pour chacune des lignes (à l'intérieur de la boucle, donc),
on peut récupérer la valeur de chacune des colonnes avec des appels aux méthodes
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getDouble(java.lang.String)">getDouble(String colName)</a>, <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getInt(java.lang.String)">getInt(String colName)</a>, <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getLong(java.lang.String)">getLong(String colName)</a>,
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getString(java.lang.String)">getString(String colName)</a> et autres. Il est aussi possible de passer des numéros
de colonne en argument plutôt que d'utiliser les noms, mais il faut alors se
souvenir non seulement de l'ordre des colonnes dans le resultat, mais aussi que
leur numérotation commence à 1 et non à 0. Toujours dans un soucis de plus
grande compatibilité avec tous les drivers JDBC disponibles, mais aussi dans un
soucis de performance, il est préférable de se contenter de lire les lignes les
unes après les autres et pour chaque ligne et de ne lire les données qu'une
seule fois pour une instance de <code>ResultSet</code> donnée.
</p>

<p>
Par exemple, pour afficher le contenue d'une table <code>city</code> contenant des communes avec leur latitude et longitude, on pourrait écrire le code suivant :
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">try</span> (<span style="color: #6434A3;">Statement</span> <span style="color: #BA36A5;">stmt</span> = conn.createStatement()) {
    <span style="color: #6434A3;">ResultSet</span> <span style="color: #BA36A5;">rs</span> = stmt.executeQuery(<span style="color: #008000;">"SELECT id, name, latitude, longitude from city"</span>);
    <span style="color: #0000FF;">while</span> (rs.next()) {
        <span style="color: #0000FF;">try</span> {
            System.out.println(String.format(<span style="color: #008000;">"id: %d, name: %s, latitude: %f, longitude: %f"</span>,
                                             rs.getLong(<span style="color: #008000;">"id"</span>),
                                             rs.getString(<span style="color: #008000;">"name"</span>),
                                             rs.getDouble(<span style="color: #008000;">"latitude"</span>),
                                             rs.getDouble(<span style="color: #008000;">"longitude"</span>)));
        } <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span>) {
            System.err.println(e);
        }
    }

} <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">SQLException</span> <span style="color: #BA36A5;">e</span>) {
    e.printStackTrace();
}

</pre>
</div>

<p>
On lit des (références vers des) objets plutôt que des valeurs de types
primitifs lorsque les colonnes peuvent contenir des <code>NULL</code>, auquel cas la
référence retournées est nulle.
</p>


<dl class="org-dl">
<dt>Exercice</dt><dd>Écrire un programme qui afficher le contenu d'une table
<code>city</code> contenant des communes avec leur latitude et
longitude. Vous pouvez créer une telle table en local,
mais aussi utiliser une table <code>city</code> disponible sur le
serveur <code>horton.elephantsql.com</code> au port <code>5432</code> avec
comme login <code>vnzaekhx</code> et comme mot de passe
<code>oWN4ryvxxdjYWsko1u3WTW23k6yB7bM9</code>.</dd>
<dt>Exercice</dt><dd>Écrire un programme qui remplisse une table d'une base
de données locale à partir du fichier <code>Communes.csv</code> qui
avait été donné lors de la session précédente.</dd>
<dt>Exercice</dt><dd>Écrire un programme qui remplisse une table d'une base
de données locales à partir des donnés mises à
disposition par <a href="http://sql.sh/736-base-donnees-villes-francaises">données mises à disposition par Tony
Archambeau</a>.</dd>
</dl>
</div>
</div>

<div id="outline-container-org6081f53" class="outline-3">
<h3 id="org6081f53"><span class="section-number-3">3.4</span> Exemple de relation Many to Many, table d'associations</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Pour le stockage de l'information concernant les codes postaux de chacune des
villes, le format proposé (une colonne de type chaîne de caractères pouvant
contenir une liste de codes postaux séparés par des '-', n'est ni pratique ni
performant. On va écrire un programme implémentant la relation «Many to Many»
par une table d'associations. Il s'agit d'une relation «Many to Many» car une
ville peut avoir plusieurs codes postaux, mais un code postal peut être associé
à plusieurs villes. Pour représenter cette association, on va créer deux tables :
</p>
<ul class="org-ul">
<li>une table <code>postalcodes</code> qui va contenir la chaîne de caractère du code
postal et un identifiant.</li>
<li>une table <code>city_postalcode</code> qui va contenir les associations entre la table
<code>cities</code> et la table <code>postalcodes</code>, avec seulement les deux colonnes
<code>cities_pk</code> et <code>postalcodes_pk</code> ("pk" pour Primary Key). La clé primaire de
cette table est constituée par ces deux colonnes.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: bernard</p>
<p class="date">Created: 2019-12-04 Wed 01:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
